app/views/users/show.html.erb

  <div class="col-md-8">
    <% if @user.activities.any? %>
---
SELECT  1 AS one FROM "activities" WHERE "activities"."user_id" = ? LIMIT ?  [["user_id", 762146111], ["LIMIT", 1]]