app/views/shared/_user_info.html.erb

SELECT COUNT(*) FROM "activities" WHERE "activities"."user_id" = ?  [["user_id", 762146111]]
---
<span><%= link_to "view my profile", current_user %></span>
<span><%= pluralize(current_user.activities.count, "activity") %></span>