app/controllers/activities_controller.rb

  def create
    @activity = current_user.activities.build(activity_params)
    if @activity.save
---
INSERT INTO "activities" ("title", "category", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "title"], ["category", "学習"], ["user_id", 1], ["created_at", "2020-02-03 04:21:32.488271"], ["updated_at", "2020-02-03 04:21:32.488271"]]

  def destroy
    @activitiy.destroy
---
DELETE FROM "activities" WHERE "activities"."id" = ?  [["id", 52]]