app/controllers/static_pages_controller.rb

SELECT  "activities".* FROM "activities" WHERE "activities"."user_id" = ? ORDER BY "activities"."created_at" DESC LIMIT ? OFFSET ?  [["user_id", 762146111], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "activities" WHERE "activities"."user_id" = ?  [["user_id", 762146111]]
---
  def home
    if logged_in?
      @activity = current_user.activities.build
      @feed_items = current_user.feed.paginate(page: params[:page])