app/controllers/users_controller.rb

  def index
    # @users = User.paginate(page: params[:page])
    @users = User.where(activated: true).paginate(page: params[:page])
---
SELECT  "users".* FROM "users" WHERE "users"."activated" = ? LIMIT ? OFFSET ?  [["activated", "t"], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE "users"."activated" = ?  [["activated", "t"]]

  def show
    @user = User.find(params[:id])
    @activities = @user.activities.paginate(page: params[:page])

    @user_m = User.includes(activities: :microposts).find_by_id(params[:id])
    @microposts = Kaminari.paginate_array(@user_m.activities.map(&:microposts).flatten).page(params[:page]).per(10)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 762146111], ["LIMIT", 1]]
SELECT  "activities".* FROM "activities" WHERE "activities"."user_id" = ? ORDER BY "activities"."created_at" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "activities" WHERE "activities"."user_id" = ?  [["user_id", 1]]
SELECT  DISTINCT "users"."id" FROM "users" LEFT OUTER JOIN "activities" ON "activities"."user_id" = "users"."id" LEFT OUTER JOIN "microposts" ON "microposts"."activity_id" = "activities"."id" WHERE "users"."id" = ? ORDER BY microposts.created_at DESC LIMIT ?  [["id", 762146111], ["LIMIT", 1]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]